app/views/events/_activity.html.erb

      <p class="label">Tipo de Actividad</p>
      <%= collection_select(:activity, :activity_type_id, ActivityType.all, :id, :name,{:selected => activity.activity_type.id} prompt: true) %>
---
SELECT "activities".* FROM "activities" WHERE "activities"."event_id" = $1  [["event_id", 1]]
SELECT "activity_types".* FROM "activity_types"