app/views/events/_multiple_access.html.erb

      <p class="label">Tipo de Boleto</p>
      <%= collection_select(:multiple_access, :ticket_type_id, TicketType.where(event: event), :id, :name,{selected: ticket_type.id}, prompt: true) %>
---
SELECT "ticket_types".* FROM "ticket_types" WHERE "ticket_types"."event_id" = 1

      <p class="label">Tipo de actividad</p>
      <%= collection_select(:multiple_access, :activity_type_id, ActivityType.all, :id, :name, prompt: true) %>
---
SELECT "activity_types".* FROM "activity_types"