app/views/events/_question.html.erb

      <p class="label">Tipo de Boleto</p>
      <%= collection_select(:question, :ticket_type_id, TicketType.where(event_id: event.id), :id, :name,{:selected => ticket_type.id}, prompt: true) %>
---
SELECT "ticket_types".* FROM "ticket_types" WHERE "ticket_types"."event_id" = $1  [["event_id", 1]]