app/views/events/_single_access.html.erb

SELECT "ticket_types".* FROM "ticket_types" WHERE "ticket_types"."event_id" = $1  [["event_id", 1]]
---
      <p class="label">Tipo de Boleto</p>
      <%= collection_select(:single_access, :ticket_type_id, TicketType.where(event_id: event.id), :id, :name,{selected: ticket_type.id}, prompt: true) %>

SELECT "activities".* FROM "activities" WHERE "activities"."event_id" = $1  [["event_id", 1]]
---
      <p class="label">Actividad</p>
      <%= collection_select(:single_access, :activity_id, Activity.where(event_id: event.id), :id, :name, prompt: true) %>