app/views/events/manager.html.erb

SELECT "activities".* FROM "activities" WHERE "activities"."event_id" = $1  [["event_id", 1]]
---
    <tbody>
      <% @event.activities.each do |activity| %>

SELECT "ticket_types".* FROM "ticket_types" WHERE "ticket_types"."event_id" = $1  [["event_id", 1]]
---
  <table>
    <% @event.ticket_types.each do |ticket_type| %>

SELECT "single_accesses".* FROM "single_accesses" WHERE "single_accesses"."ticket_type_id" = $1  [["ticket_type_id", 1]]
---
      </tr>
      <% ticket_type.single_accesses.each do |single_access| %>

SELECT "multiple_accesses".* FROM "multiple_accesses" WHERE "multiple_accesses"."ticket_type_id" = $1  [["ticket_type_id", 1]]
---
      </tr>
      <% ticket_type.multiple_accesses.each do |multiple_access| %>

SELECT "questions".* FROM "questions" WHERE "questions"."ticket_type_id" = $1  [["ticket_type_id", 1]]
---
      </tr>
      <% ticket_type.questions.each do |question| %>