app/views/events/preregister.html.erb

SELECT "multiple_accesses".* FROM "multiple_accesses" WHERE "multiple_accesses"."ticket_type_id" = $1  [["ticket_type_id", 1]]
---
        <p class="subtitle">Actividades</p>
        <% @ticket.ticket_type.multiple_accesses.each do |multiple_access| %>

SELECT "activities".* FROM "activities" WHERE "activities"."activity_type_id" = $1 AND "activities"."event_id" = $2  [["activity_type_id", 1], ["event_id", 1]]
---
            <p class="label"><%=multiple_access.activity_type.name%> (selecciona <%=multiple_access.amount%>)</p>
            <%= f.collection_check_boxes(:activity_ids, Activity.where(activity_type_id: multiple_access.activity_type.id, event_id: @event.id).select {|activity| activity.capacity > activity.tickets.count}.sort_by(&:name) , :id, :name) do |b| %>