app/controllers/activities_controller.rb

  def index
    @activities = Activity.all
---
SELECT "activities".* FROM "activities"

  def edit
    @activity = Activity.find(params[:id])
---
SELECT  "activities".* FROM "activities" WHERE "activities"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @activity = Activity.new(activity_params)
    @activity.event_id = 1
    @activity.valid?
    puts @activity.errors.full_messages
    respond_to do |format|
      if @activity.save
---
INSERT INTO "activities" ("name", "description", "date", "time", "location", "host", "event_id", "activity_type_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

  def update
    respond_to do |format|
      if @activity.update(activity_params)
---
UPDATE "activities" SET "name" = $1, "location" = $2, "time" = $3, "updated_at" = $4 WHERE "activities"."id" = $5  [["name", "CONFERENCIA 2"], ["location", "Aulas 7"], ["time", "16:00:00"], ["updated_at", "2018-02-15 09:15:45.029633"], ["id", 3]]

  def destroy
    @activity.destroy
---
DELETE FROM "activities" WHERE "activities"."id" = $1  [["id", 10]]

    def set_activity
      @activity = Activity.find(params[:id])
---
SELECT  "activities".* FROM "activities" WHERE "activities"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]