app/controllers/events_controller.rb

SELECT  "tickets".* FROM "tickets" WHERE "tickets"."reference" = $1 LIMIT $2  [["reference", "b"], ["LIMIT", 1]]
---
  def preregister
    @event = Event.find(params[:id])
    if params[:reference]
      @ticket = Ticket.find_by!(reference: params[:reference])

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "ticket_types".* FROM "ticket_types" WHERE "ticket_types"."event_id" = $1  [["event_id", 1]]
---
  def sale
    if current_user
      @event = Event.find(params[:id])
      @ticket_types = @event.available_ticket_types
      @selected_ticket_type = params[:ticket_type] ? params[:ticket_type] : @ticket_types.first

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT  "activities".* FROM "activities" WHERE "activities"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT  "ticket_types".* FROM "ticket_types" WHERE "ticket_types"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "single_accesses".* FROM "single_accesses" WHERE "single_accesses"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "multiple_accesses".* FROM "multiple_accesses" WHERE "multiple_accesses"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def manager
    if current_user
      @event = Event.find(params[:id])
      if params[:activity]
        @activity = Activity.find(params[:activity])
      else
        @activity = Activity.new
      end

      if params[:ticket_type]
        @ticket_type = TicketType.find(params[:ticket_type])
      else
        @ticket_type = TicketType.new
      end

      if params[:single_access]
        @single_access = SingleAccess.find(params[:single_access])
      else
        @single_access = SingleAccess.new
      end

      if params[:multiple_access]
        @multiple_access = MultipleAccess.find(params[:multiple_access])
      else
        @multiple_access = MultipleAccess.new
      end

      if params[:question]
        @question = Question.find(params[:question])