app/controllers/multiple_accesses_controller.rb

  def index
    @multiple_accesses = MultipleAccess.all
---
SELECT "multiple_accesses".* FROM "multiple_accesses"

  def create
    @multiple_access = MultipleAccess.new(multiple_access_params)

    respond_to do |format|
      if @multiple_access.save
---
INSERT INTO "multiple_accesses" ("amount", "ticket_type_id", "activity_type_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["amount", 3], ["ticket_type_id", 1], ["activity_type_id", 2], ["created_at", "2018-02-15 21:05:14.847486"], ["updated_at", "2018-02-15 21:05:14.847486"]]

  def update
    respond_to do |format|
      if @multiple_access.update(multiple_access_params)
---
UPDATE "multiple_accesses" SET "amount" = $1, "updated_at" = $2 WHERE "multiple_accesses"."id" = $3  [["amount", 3], ["updated_at", "2018-02-15 21:14:20.459157"], ["id", 1]]

  def destroy
    @multiple_access.destroy
---
DELETE FROM "multiple_accesses" WHERE "multiple_accesses"."id" = $1  [["id", 3]]

    def set_multiple_access
      @multiple_access = MultipleAccess.find(params[:id])
---
SELECT  "multiple_accesses".* FROM "multiple_accesses" WHERE "multiple_accesses"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]