app/controllers/questions_controller.rb

  def create
    @question = Question.new(question_params)

    respond_to do |format|
      if @question.save
---
INSERT INTO "questions" ("sentence", "ticket_type_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["sentence", "Pregunta de prueba"], ["ticket_type_id", 1], ["created_at", "2018-02-15 20:50:06.099866"], ["updated_at", "2018-02-15 20:50:06.099866"]]

  def update
    respond_to do |format|
      if @question.update(question_params)
---
UPDATE "questions" SET "sentence" = $1, "updated_at" = $2 WHERE "questions"."id" = $3  [["sentence", "What is love? Baby dont hurt me"], ["updated_at", "2018-02-15 20:45:32.981568"], ["id", 1]]

  def destroy
    @question.destroy
---
DELETE FROM "questions" WHERE "questions"."id" = $1  [["id", 3]]