app/controllers/single_accesses_controller.rb

INSERT INTO "single_accesses" ("ticket_type_id", "activity_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["ticket_type_id", 1], ["activity_id", 11], ["created_at", "2018-02-15 21:00:06.414397"], ["updated_at", "2018-02-15 21:00:06.414397"]]
---
  def create
    @single_access = SingleAccess.new(single_access_params)

    respond_to do |format|
      if @single_access.save

UPDATE "single_accesses" SET "activity_id" = $1, "updated_at" = $2 WHERE "single_accesses"."id" = $3  [["activity_id", 12], ["updated_at", "2018-02-15 20:43:17.830324"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @single_access.update(single_access_params)

DELETE FROM "single_accesses" WHERE "single_accesses"."id" = $1  [["id", 7]]
---
  def destroy
    @single_access.destroy

SELECT  "single_accesses".* FROM "single_accesses" WHERE "single_accesses"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
    def set_single_access
      @single_access = SingleAccess.find(params[:id])