app/controllers/ticket_types_controller.rb

  def create
    @ticket_type = TicketType.new(ticket_type_params)
    @ticket_type.event_id = current_user.event_id
    respond_to do |format|
      if @ticket_type.save
---
INSERT INTO "ticket_types" ("name", "description", "price", "event_id", "created_at", "updated_at", "max_tickets") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    respond_to do |format|
      if @ticket_type.update(ticket_type_params)
---
UPDATE "ticket_types" SET "name" = $1, "max_tickets" = $2, "updated_at" = $3 WHERE "ticket_types"."id" = $4  [["name", "Azulado"], ["max_tickets", 51], ["updated_at", "2018-02-15 23:05:36.893989"], ["id", 1]]

    def set_ticket_type
      @ticket_type = TicketType.find(params[:id])
---
SELECT  "ticket_types".* FROM "ticket_types" WHERE "ticket_types"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]