app/controllers/tickets_controller.rb

  def create
    @ticket = Ticket.new(ticket_params)
    event = @ticket.ticket_type.event
    respond_to do |format|
      if @ticket.save
---
INSERT INTO "tickets" ("reference", "email", "fullName", "ticket_type_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["reference", "abcdefg"], ["email", "daniel@gmail.com"], ["fullName", "Daniel"], ["ticket_type_id", 1], ["created_at", "2018-02-12 01:06:14.341448"], ["updated_at", "2018-02-12 01:06:14.341448"]]